# variable_min.py

from minecraft import *         # 마크를 제어하기 하기 위해 사용



# setpos(x, y, z)
# x, y, z 좌표로 이동
# setpos(100, 100, 100)


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# x = 200
# y = 200
# z = 200

# setpos(x,y,z)


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 변수를 이용해 500, 100, 300 위치로 이동하는 코드
# x = 500
# y = 100
# z = 300
# setpos(x, y, z)
# print('location :', getpos())       # getpos()는 현재 좌표를 알려줌


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# setblock(x, y, z, b)
# 좌표 x, y, z에 블록의 id가 b인 블록을 생성

# x = 100
# y = 100
# z = 100
# b = 2
# setpos(x, y, z)
# setblock(x, y, z, b)


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 좌표 100, 100, 100으로 이동한 뒤 자신의 발 밑에 잔디 블록을 생성

# x = 100
# y = 100
# z = 100
# b = 2

# setpos(x, y, z)
# setblock(x, y-1, z, b)


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 발 밑 블록 앞에 블록을 더 만들기
# x = 100
# y = 100
# z = 100
# b = 2
# gold = 41
# setpos(x, y, z)
# setblock(x, y-1, z, b)
# setblock(x, y-1, z+1, gold)
# setblock(x-1, y-1, z+1, gold)
# setblock(x-2, y-1, z+1, gold)
# setblock(x-3, y-1, z+1, gold)
# setblock(x-4, y-1, z+1, gold)

